"""             -
               ___
               UI
              _____
             _______
           Integration
           ___________
          _____________
              Unit

Unit-тесты
- Написание unit-тестов вскрывает проблемы и пограничные ситуации
- Тесты помогают определить проблему
- Быстро выполняются
- Быстро написать, легко поддерживать

Интеграционные-тесты
- Дольше, чем unit-тесты
- Средняя сложность
- Поддержка и изменения дороже, чем у unit-тестов

UI-тесты
- Очень долгие
- Сложно разрабатывать
- Дорогие на поддержку и изменения
    """